In [49]:
import numpy as np
import pandas as pd

In [50]:
training_Data = pd.read_csv('titanic_trainingData.csv')
testing_Data = pd.read_csv('titanic_testData.csv')

In [51]:
training_Data.isnull().sum()

Pclass        0
Name          0
Sex           0
Age         132
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       514
Embarked      1
Survived      0
dtype: int64

In [52]:
training_Data['Age'].fillna(training_Data['Age'].median(),inplace=True)
testing_Data['Age'].fillna(testing_Data['Age'].median(),inplace=True)

In [53]:
training_Data.drop("Cabin",inplace=True,axis=1)
training_Data.dropna(inplace=True)
testing_Data.drop("Cabin",inplace=True,axis=1)
testing_Data.dropna(inplace=True)

In [54]:
training_Data.isnull().sum()

Pclass      0
Name        0
Sex         0
Age         0
SibSp       0
Parch       0
Ticket      0
Fare        0
Embarked    0
Survived    0
dtype: int64

In [55]:
sex = pd.get_dummies(training_Data["Sex"],drop_first=True)
embarked = pd.get_dummies(training_Data["Embarked"],drop_first=True)
pclass = pd.get_dummies(training_Data["Pclass"],drop_first=True)
training_Data.drop(["Pclass","Name","Sex","Ticket","Embarked"],axis=1,inplace=True)
training_Data = pd.concat([training_Data,pclass,sex,embarked],axis=1)
training_Data

      Age  SibSp  Parch     Fare  Survived  2  3  male  Q  S
0    29.0      1      0  26.0000         1  1  0     0  0  1
1    29.0      0      0   8.0500         0  0  1     1  0  1
2    39.0      0      0  26.0000         0  1  0     1  0  1
3    29.0      0      4  21.0750         0  0  1     0  0  1
4    25.0      0      0   7.0500         0  0  1     1  0  1
..    ...    ...    ...      ...       ... .. ..   ... .. ..
663  17.0      0      0  10.5000         1  1  0     0  0  1
664  29.0      0      0   7.7500         0  0  1     1  1  0
665  32.0      0      0  56.4958         1  0  1     1  0  1
666  22.0      0      0   9.8375         0  0  1     0  0  1
667  29.0      1      0  15.5000         1  0  1     0  1  0

[667 rows x 10 columns]

In [56]:
sex = pd.get_dummies(testing_Data["Sex"],drop_first=True)
embarked = pd.get_dummies(testing_Data["Embarked"],drop_first=True)
pclass = pd.get_dummies(testing_Data["Pclass"],drop_first=True)
testing_Data.drop(["Pclass","Name","Sex","Ticket","Embarked"],axis=1,inplace=True)
testing_Data = pd.concat([testing_Data,pclass,sex,embarked],axis=1)
testing_Data

      Age  SibSp  Parch      Fare  2  3  male  Q  S
0     8.0      1      1   36.7500  1  0     1  0  1
1    49.0      0      0   25.9292  0  0     0  0  1
2    27.0      0      0    7.7375  0  1     1  1  0
3    24.0      2      1   27.0000  1  0     0  0  1
4    36.0      0      0   26.2875  0  0     1  0  1
..    ...    ...    ...       ... .. ..   ... .. ..
218  20.0      1      0    7.9250  0  1     1  0  1
219  45.0      0      0   26.5500  0  0     1  0  1
220  17.0      1      0  108.9000  0  0     0  0  0
221  43.0      0      0    6.4500  0  1     1  0  1
222  36.5      0      2   26.0000  1  0     1  0  1

[222 rows x 9 columns]

In [57]:
X_train = training_Data.drop("Survived",axis=1)
y_train = training_Data["Survived"]

In [61]:
X_train=X_train.to_numpy()

In [10]:
X_train.dtypes

Age      float64
SibSp      int64
Parch      int64
Fare     float64
2          uint8
3          uint8
male       uint8
Q          uint8
S          uint8
dtype: object

In [62]:
from sklearn.linear_model import LogisticRegression
logmodel = LogisticRegression(max_iter=10000,solver='sag',multi_class='ovr')
logmodel.fit(X_train,y_train)

LogisticRegression(max_iter=10000, multi_class='ovr', solver='sag')

In [66]:
X_test = testing_Data
X_test = X_test.to_numpy()

In [67]:
predictions = logmodel.predict(X_test)

In [68]:
predictions

array([0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0,
       1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0,
       1, 0, 0, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0,
       0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0,
       0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0,
       0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0,
       1, 0, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 1, 0, 1, 0,
       0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 1, 1,
       1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 1,
       0, 0], dtype=int64)

In [16]:
np.savetxt("predictions_titanic.csv",predictions,delimiter=",")

In [69]:
logmodel.score(X_train,y_train)

0.7886056971514243

In [18]:
training_Data = pd.read_csv('titanic_trainingData.csv')
testing_Data = pd.read_csv('titanic_testData.csv')

In [19]:
training_Data.isnull().sum()

Pclass        0
Name          0
Sex           0
Age         132
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       514
Embarked      1
Survived      0
dtype: int64

In [20]:
training_Data["Age"].fillna(training_Data["Age"].median(skipna=True), inplace=True)
training_Data["Embarked"].fillna(training_Data['Embarked'].value_counts().idxmax(), inplace=True)
training_Data.drop('Cabin', axis=1, inplace=True)

In [21]:
training_Data.isnull().sum()

Pclass      0
Name        0
Sex         0
Age         0
SibSp       0
Parch       0
Ticket      0
Fare        0
Embarked    0
Survived    0
dtype: int64

In [22]:
training_Data['TravelAlone']=np.where((training_Data["SibSp"]+training_Data["Parch"])>0, 0, 1)
training_Data.drop('SibSp', axis=1, inplace=True)
training_Data.drop('Parch', axis=1, inplace=True)

In [24]:
training=pd.get_dummies(training_Data, columns=["Pclass","Embarked","Sex"])
training.drop('Sex_female', axis=1, inplace=True)
training.drop('Name', axis=1, inplace=True)
training.drop('Ticket', axis=1, inplace=True)

final_train = training
final_train.head()

,Age,Fare,Survived,TravelAlone,Pclass_1,Pclass_2,Pclass_3,Embarked_C,Embarked_Q,Embarked_S,Sex_male
0,29.0,26.000,1,0,0,1,0,0,0,1,0
1,29.0,8.050,0,1,0,0,1,0,0,1,1
2,39.0,26.000,0,1,0,1,0,0,0,1,1
3,29.0,21.075,0,0,0,0,1,0,0,1,0
4,25.0,7.050,0,1,0,0,1,0,0,1,1

In [25]:
testing_Data.isnull().sum()

Pclass        0
Name          0
Sex           0
Age          45
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       173
Embarked      1
dtype: int64

In [28]:
test_data = testing_Data.copy()
test_data["Age"].fillna(training_Data["Age"].median(skipna=True), inplace=True)
test_data["Fare"].fillna(training_Data["Fare"].median(skipna=True), inplace=True)
test_data.drop('Cabin', axis=1, inplace=True)

test_data['TravelAlone']=np.where((test_data["SibSp"]+test_data["Parch"])>0, 0, 1)

test_data.drop('SibSp', axis=1, inplace=True)
test_data.drop('Parch', axis=1, inplace=True)

testing = pd.get_dummies(test_data, columns=["Pclass","Embarked","Sex"])
testing.drop('Sex_female', axis=1, inplace=True)
testing.drop('Name', axis=1, inplace=True)
testing.drop('Ticket', axis=1, inplace=True)

final_test = testing
final_test.head()

,Age,Fare,TravelAlone,Pclass_1,Pclass_2,Pclass_3,Embarked_C,Embarked_Q,Embarked_S,Sex_male
0,8.0,36.7500,0,0,1,0,0,0,1,1
1,49.0,25.9292,1,1,0,0,0,0,1,0
2,29.0,7.7375,1,0,0,1,0,1,0,1
3,24.0,27.0000,0,0,1,0,0,0,1,0
4,36.0,26.2875,1,1,0,0,0,0,1,1

In [31]:
cols = ["Age","Fare","TravelAlone","Pclass_1","Pclass_2","Embarked_C","Embarked_S","Sex_male"] 
X_train = final_train[cols]
y_train = final_train['Survived']
logreg = LogisticRegression(max_iter=10000,solver='sag',multi_class='ovr')
logreg.fit(X_train, y_train)

LogisticRegression(max_iter=10000, multi_class='ovr', solver='sag')

In [36]:
X_test = final_test[cols]

In [37]:
pred = logreg.predict(X_test)

In [39]:
logreg.score(X_train,y_train)

0.781437125748503

In [41]:
from sklearn.ensemble import RandomForestClassifier, GradientBoostingClassifier, AdaBoostClassifier

In [42]:
model = AdaBoostClassifier(RandomForestClassifier(n_estimators = 1000),
                         algorithm="SAMME",
                         n_estimators=500)

In [43]:
model.fit(X_train, y_train)

AdaBoostClassifier(algorithm='SAMME',
                   base_estimator=RandomForestClassifier(n_estimators=1000),
                   n_estimators=500)

In [47]:
y_pred = model.predict(X_test)

In [46]:
model.score(X_train,y_train)

0.9805389221556886

In [48]:
np.savetxt("predictions_titanic.csv",y_pred,delimiter=",")